{
  "header": {
    "experience": "Опыт",
    "studies": "Образование",
    "certificates": "Сертификаты"
  },
  "home": {
    "hello": "Здравствуйте, я ",
    "name": "Ирена Шнайдер",
    "promising": "перспекивный",
    "span": "разработчик",
    "specialized": "специализируюсь на React, Redux и современных веб-технологиях. Я разрабатываю удобные и масштабируемые приложения.",
    "project_Button": "Проекты",
    "what_can_i_do": "Что я могу сделать",
    "all_kinds": "Все виды веб-приложений для различных нужд. Персонализированные решения и индивидуальные подходы для каждой проектной команды.",
    "block1_title": "разработка и бесшовная интеграция с бэкендом",
    "block1_discreption": "Используйте мой опыт в JavaScript, TypeScript, React, Redux, HTML5, CSS, Emotional, MaterialUI и Tailwind для разработки динамичных и удобных веб-приложений. Реализация бесшовных взаимодействий между фронтендом и бэкендом с использованием API и Node.js для оптимального пользовательского опыта.",
    "block2_title": "Дизайн и",
    "br": "прототипирование",
    "block2_discreption": "Создание привлекательных пользовательских интерфейсов с использованием современных инструментов, таких как Figma. Обеспечение адаптивного дизайна с помощью медиазапросов для оптимального отображения на различных устройствах.",
    "block3_title": "разработка и тестирование",
    "block3_discreption": "Разработка надежных бэкенд-решений с использованием Java и Spring Framework (Spring Boot, MVC, Security, Data JPA). Эффективное управление зависимостями с помощью Maven и развертывание приложений на Tomcat. Комплексное тестирование с использованием JUnit5 и Postman, а также структурированный контроль версий с помощью Git и GitHub."
  },
  "footer": {
    "country": "Германия",
    "city": "Штраубинг",
    "download": "Резюме скачать",
    "CV": "резюме",
    "data": "Июнь 2024"
  },
  "studies": {
    "studies_title": "Образование и обучение",
    "institut": "Самарский юридический институт Федеральной Службы исполнения наказаний",
    "country_city1": "Россия, Самара",
    "description_studies1": "Диплом с отличием по специальности юриспруденция",
    "description_ait-tr": "Школа",
    "country_city2": "Германия, Берлин",
    "description_studies2": "Fullstack-разработчик с акцентом на  frontend-разработку"
  },
  "certificates": {
    "certificates_title": "Мои сертификаты"
  },
  "experience": {
    "experience_title": "Профессиональный опыт"
  },
  "jobs": [
    {
      "title": "Front-End разработчик",
      "company": "LeafGrow ",
      "companyDescription": "Startup",
      "link": "https://leafgrow-app-foign.ondigitalocean.app/#/",
      "period": "Апрель 2024 - натоящее время",
      "location": "Германия",
      "responsibilities": "Основные обязанности:",
      "description": [
        {
          "titleDescription": "Проектирование и реализация фронтенд-архитектуры с использованием React для масштабируемых и поддерживаемых приложений.",
          "span": [
            "Проектирование архитектуры:",
            "Реализация:",
            "Масштабируемость:",
            "Поддерживаемость:"
          ],
          "li": [
            "Включает планирование и создание структуры приложения. Это включает выбор подходящих шаблонов проектирования, модульную разработку и обеспечение разделения ответственности.",
            "Реализация архитектурных решений с помощью React. Это включает создание компонентов, настройку маршрутизации (с помощью React Router), установление глобального состояния и управление жизненным циклом компонентов.",
            "Обеспечение того, чтобы приложение могло легко масштабироваться и обрабатывать большее количество данных и пользователей без потери производительности.",
            "Обеспечение легкости обслуживания и обновления кода. Это включает написание чистого и хорошо документированного кода, использование модульных и повторно используемых компонентов, а также внедрение тестов."
          ]
        },
        {
          "titleDescription": "Управление состоянием с Redux для обеспечения согласованности состояния",
          "span": ["Управление состоянием: ", "Redux: ", "Согласованность: "],
          "li": [
            "Управление состоянием приложения для обеспечения того, чтобы данные были согласованными и корректно отображались во всех компонентах.",
            "Использование библиотеки Redux для централизованного управления состоянием. Это включает создание действий, редукторов и хранилища.",
            "Обеспечение того, чтобы состояние приложения было единообразным и легко отслеживаемым. Это важно для отладки и предсказуемого поведения приложения."
          ]
        },
        {
          "titleDescription": "Бесшовная интеграция фронтенда и бэкенда с использованием API и Node.js",
          "span": ["Интеграция: ", "API: ", "Node.js: "],
          "li": [
            "Настройка взаимодействия между клиентской (фронтенд) и серверной (бэкенд) частями через API.",
            "Создание и использование API для обмена данными между фронтендом и бэкендом. Это может включать RESTful API или GraphQL.",
            "Использование Node.js для разработки серверной логики. Это может включать настройку сервера, маршрутизацию запросов и управление базой данных."
          ]
        },
        {
          "titleDescription": "Эффективное управление запросами к API и разрешение ошибок",
          "span": ["Запросы к API: ", "Разрешение ошибок: "],
          "li": [
            "Создание и выполнение HTTP-запросов к API. Это включает использование библиотек, таких как Axios или Fetch.",
            "Обработка ошибок при выполнении запросов к API. Это может включать настройку глобальных обработчиков ошибок, использование блоков try-catch и предоставление понятных сообщений об ошибках пользователям."
          ]
        },
        {
          "titleDescription": "Разработка интуитивно понятных компонентов пользовательского интерфейса и интерактивных функций",
          "span": [
            "Компоненты пользовательского интерфейса: ",
            "Интерактивные функции: "
          ],
          "li": [
            "Создание пользовательских интерфейсов (UI) с помощью компонентов React. Это включает создание форм, кнопок, модальных окон и других элементов UI.",
            "Разработка интерактивных элементов, таких как анимации, переходы и интерактивные карты, для улучшения пользовательского опыта."
          ]
        },
        {
          "titleDescription": "Реализация безопасных функций для регистрации пользователей и аутентификации",
          "span": ["Регистрация пользователей: ", "Аутентификация: "],
          "li": [
            "Создание системы регистрации пользователей. Это включает в себя проверку форм, отправку данных на сервер и обработку ответов.",
            "Настройка систем аутентификации пользователей. Это может включать использование JWT (JSON Web Tokens), OAuth или других методов."
          ]
        },
        {
          "titleDescription": "Управление и обновление профилей пользователей",
          "span": ["Профили пользователей: ", "Обновление: "],
          "li": [
            "Создание и управление профилями пользователей. Это включает отображение информации о пользователях, возможность редактирования профиля и загрузку аватаров.",
            "Обеспечение возможности пользователям обновлять свою информацию и сохранять эти изменения на сервере."
          ]
        },
        {
          "titleDescription": "Персонализация контента на основе предпочтений пользователей",
          "span": ["Персонализация: ", "Предпочтения пользователей: "],
          "li": [
            "Настройка отображаемого контента на основе предпочтений пользователей. Это может включать рекомендации, персонализированные новостные ленты и настройки интерфейса.",
            "Хранение и использование предпочтений пользователей для улучшения взаимодействия с приложением."
          ]
        },
        {
          "titleDescription": "Работа в высоко кооперативной команде и отличная скоординированная работа",
          "span": [
            "Командная среда: ",
            "Сотрудничество: ",
            "Эффективное взаимодействие: ",
            "Успех проекта: "
          ],
          "li": [
            "Сотрудничество с разработчиками, дизайнерами и менеджерами проектов.",
            "Использование систем контроля версий (например, Git), участие в командных встречах и обсуждениях.",
            "Обмен знаниями и опытом, совместное решение проблем.",
            "Вклад в успешное завершение, соблюдение сроков и достижение целей."
          ]
    }
      ]
},
    {
      "title": "Fullstack разработчик студент",
      "company": "AIT-TR",
      "companyDescription": "GmbH",
      "link": "https://www.ait-tr.de/de",
      "period": "Ноябрь 2023 – Июнь 2024",
      "location": "Германия, Берлин",
      "responsibilities": "Основные обязанности:",
      "description": [
        {
          "titleDescription": "Разработка динамических приложений с использованием JavaScript, TypeScript и React",
          "span": [
            "Использование современных технологий JavaScript:",
            "Эффективные и отзывчивые пользовательские интерфейсы:",
            "Управление состоянием с Redux:",
            "Стилизация с Tailwind CSS:",
            "Разметка с HTML5 и CSS:"
          ],
          "li": [
            "Разработка приложений с использованием JavaScript и TypeScript для обеспечения строгой типизации и улучшенной поддерживаемости.",
            "Создание пользовательских интерфейсов с React, которые являются как отзывчивыми, так и эффективными.",
            "Реализация Redux для надежного управления состоянием в сложных приложениях.",
            "Использование Tailwind CSS для быстрой и эффективной разработки современных и привлекательных UI-дизайнов.",
            "Использование HTML5 и CSS для структурирования и оформления веб-страниц."
          ]
        },
        {
          "titleDescription": "Интеграция интерфейсов с использованием API и Node.js",
          "span": ["Интеграция API:", "Серверное программирование с Node.js:"],
          "li": [
            "Разработка и интеграция RESTful API для обеспечения связи между фронтендом и бекендом.",
            "Создание серверной логики и сервисов с использованием Node.js для бесперебойной связи и передачи данных."
          ]
        },
        {
          "titleDescription": "Углубление моих знаний в Java и Spring",
          "span": [
            "Spring Framework:",
            "Операции с базами данных с использованием Hibernate:"
          ],
          "li": [
            "Работа с Spring Boot, MVC, Security и Data JPA для разработки надежных и масштабируемых серверных решений.",
            "Использование Hibernate для эффективных и производительных операций с базами данных в Java-приложениях."
          ]
        },
        {
          "titleDescription": "Управление зависимостями с помощью Maven и развертывание приложений через Tomcat",
          "span": [
            "Управление зависимостями с Maven:",
            "Развертывание через Tomcat:"
          ],
          "li": [
            "Использование Maven для управления зависимостями проекта и автоматизации сборок.",
            "Развертывание Java-приложений на сервере Apache Tomcat для производства."
          ]
        },
        {
          "titleDescription": "Реализация веб-коммуникации и веб-сервисов с использованием HTTP и REST",
          "span": ["HTTP и REST:", "Веб-коммуникация:"],
          "li": [
            "Использование протоколов HTTP и архитектуры REST для создания веб-сервисов и реализации коммуникационных интерфейсов.",
            "Обеспечение эффективной и безопасной коммуникации между различными системами и компонентами."
          ]
        },
        {
          "titleDescription": "Выполнение сложных запросов к базам данных с использованием SQL",
          "span": ["SQL-запросы:", "Управление базами данных:"],
          "li": [
            "Выполнение сложных запросов и манипуляций с данными с помощью SQL в реляционных системах баз данных, таких как MySQL и PostgreSQL.",
            "Управление и оптимизация баз данных для обеспечения оптимальной производительности и целостности данных."
          ]
        },
        {
          "titleDescription": "Версионирование изменений в базе данных с использованием Liquibase",
          "span": ["Версионирование базы данных:", "Непрерывная интеграция:"],
          "li": [
            "Использование Liquibase для отслеживания и управления изменениями и версиями базы данных.",
            "Обеспечение бесшовной интеграции и непрерывной поставки через автоматизированные изменения и миграции базы данных."
          ]
        }
      ]
    },
    {
      "title": "Руководитель юридического отдела",
      "company": "Простройконтракт",
      "companyDescription": "Холдинг строительных компаний",
      "link": "https://psk-holding.ru/about/english/",
      "period": "Сентябрь 2014 – Февраль 2018",
      "location": "Россия, Самара",
      "responsibilities": "Основные обязанности:",
      "description": [
        {
          "titleDescription": "Управление контрактами, переговоры и составление контрактов",
          "span": ["Составление и проверка контрактов: ", "Переговоры: "],
          "li": [
            "Составление, проверка и управление контрактами для обеспечения юридического соответствия и защиты интересов компании.",
            "Ведение и поддержка переговоров по контрактам с клиентами, поставщиками и партнерами для достижения оптимальных условий контрактов."
          ]
        },
        {
          "titleDescription": "Управление счетами и работа с дебиторской задолженностью",
          "span": [
            "Управление дебиторской задолженностью: ",
            "Обслуживание клиентов: "
          ],
          "li": [
            "Управление и обработка дебиторской задолженности, включая идентификацию и отслеживание открытых позиций и проведение процедур по взысканию.",
            "Поддержание отношений с клиентами и управление клиентскими счетами для обеспечения высокого уровня удовлетворенности клиентов и долгосрочных деловых отношений."
          ]
        },
        {
          "titleDescription": "Мониторинг соблюдения внутренних политик и процедур соблюдения",
          "span": ["Мониторинг соблюдения: ", "Разработка политик: "],
          "li": [
            "Обеспечение соблюдения внутренних политик и юридических регуляций через регулярные проверки и обучение.",
            "Разработка и внедрение политик и процедур для повышения соблюдения и минимизации юридических рисков."
          ]
        },
        {
          "titleDescription": "Планирование, координация и мониторинг проектов",
          "span": ["Управление проектами: ", "Мониторинг проектов: "],
          "li": [
            "Руководство и координация проектов, включая планирование, бюджетирование и мониторинг хода выполнения для обеспечения своевременной и успешной реализации.",
            "Регулярный обзор статуса проекта и принятие мер для разрешения проблем и обеспечения достижения целей проекта."
          ]
        },
        {
          "titleDescription": "Принудительное взыскание долгов с юридических и физических лиц",
          "span": [
            "Юридическое принудительное взыскание: ",
            "Сотрудничество с юристами: "
          ],
          "li": [
            "Проведение и принудительное взыскание долгов с юридических и физических лиц через юридические меры и процедуры.",
            "Сотрудничество с внутренними и внешними юристами для инициирования и осуществления юридических действий."
          ]
        },
        {
          "titleDescription": "Организация и управление всеми юридическими и проектными документами и записями",
          "span": ["Управление документами: ", "Архивирование: "],
          "li": [
            "Систематическая организация и управление всеми юридическими и проектными документами и записями для обеспечения доступности и целостности.",
            "Разработка и поддержание эффективной системы документации и архивирования для удобства отслеживания и соблюдения требований."
          ]
        },
        {
          "titleDescription": "Сотрудничество с внутренними подразделениями, внешними партнерами и юристами",
          "span": ["Внутреннее сотрудничество: ", "Внешняя коммуникация: "],
          "li": [
            "Тесное сотрудничество с другими подразделениями для координации и поддержки юридических вопросов и проектов.",
            "Координация и работа с внешними партнерами и юристами для решения юридических вопросов и переговоров по контрактам."
          ]
        },
        {
          "titleDescription": "Ответственность за бюджет юридического отдела",
          "span": ["Управление бюджетом: ", "Контроль затрат: "],
          "li": [
            "Планирование и управление бюджетом юридического отдела для обеспечения эффективного и экономичного использования ресурсов.",
            "Мониторинг и контроль расходов для соблюдения бюджета и выявления потенциальных сбережений."
          ]
        },
        {
          "titleDescription": "Выявление областей для улучшения рабочих процессов",
          "span": ["Оптимизация процессов: ", "Управление качеством: "],
          "li": [
            "Анализ и оценка существующих рабочих процессов для выявления областей для улучшения и внедрения более эффективных процессов.",
            "Внедрение мер для повышения качества и эффективности рабочих процессов внутри юридического отдела."
          ]
        }
      ]
    },
    {
      "title": "Юридический консультант в юридическом отделе",
      "company": "",
      "companyDescription": "Управление недвижимостью",
      "link": "",
      "period": "Сентябрь 2011 - Сентябрь 2014",
      "location": "Россия, Самара",
      "responsibilities": "Основные обязанности:",
      "description": [
        {
          "titleDescription": "Поддержка в управлении проектами",
          "span": ["Управление проектами: ", "Юридические консультации: "],
          "li": [
            "Помощь в планировании и выполнении проектов в области недвижимости, включая соблюдение юридических требований и сроков.",
            "Предоставление юридической поддержки и консультаций различным проектным командам для обеспечения соответствия всех действий применимым законам и нормативным актам."
          ]
        },
        {
          "titleDescription": "Организация встреч и обсуждений",
          "span": ["Планирование: ", "Протоколирование: "],
          "li": [
            "Координация и организация встреч и обсуждений, включая подготовку повесток дня и обеспечение того, чтобы все заинтересованные стороны были проинформированы и подготовлены.",
            "Документирование и отслеживание результатов и задач с встреч для обеспечения того, чтобы все участники были осведомлены о своих обязанностях и выполняли их."
          ]
        },
        {
          "titleDescription": "Поддержка в составлении, проверке и управлении контрактами",
          "span": ["Управление контрактами: ", "Поддержка переговоров: "],
          "li": [
            "Составление, проверка и управление контрактами для обеспечения их соответствия юридическим требованиям и защиты интересов компании.",
            "Поддержка переговоров по контрактам для обеспечения справедливых и выгодных условий для компании."
          ]
        },
        {
          "titleDescription": "Управление документами и мониторинг сроков",
          "span": ["Управление документами: ", "Мониторинг сроков: "],
          "li": [
            "Управление и организация всех юридических документов и файлов для обеспечения легкого доступа и эффективной обработки.",
            "Мониторинг и отслеживание важных сроков для обеспечения своевременного выполнения всех юридических обязательств."
          ]
        },
        {
          "titleDescription": "Выполнение общих административных задач",
          "span": ["Организация офиса: ", "Поддержка команды: "],
          "li": [
            "Выполнение общих административных задач, таких как ведение корреспонденции, обслуживание файлов и управление офисными принадлежностями.",
            "Предоставление административной поддержки юридической команде для обеспечения бесперебойного рабочего процесса."
          ]
        },
        {
          "titleDescription": "Координация коммуникации и информации между подразделениями",
          "span": ["Внутренняя коммуникация: ", "Управление информацией: "],
          "li": [
            "Координация и распространение информации между различными подразделениями для обеспечения эффективного сотрудничества и потока информации.",
            "Обеспечение того, чтобы вся актуальная информация оперативно и точно сообщалась соответствующим подразделениям и сотрудникам."
          ]
        }
      ]
    },
    {
      "title": "Юридический консультант",
      "company": "",
      "companyDescription": "Компания Автоюрист",
      "link": "",
      "period": "Март 2011 - Сентябрь 2011",
      "location": "Россия, Самара",
      "responsibilities": "Основные обязанности:",
      "description": [
        {
          "titleDescription": "Анализ и проверка страховых полисов и контрактов",
          "span": ["Тщательная проверка: ", "Анализ и оценка: "],
          "li": [
            "Проверка страховых полисов для обеспечения выполнения всех юридических и контрактных требований.",
            "Анализ условий и положений в контрактах для выявления и минимизации потенциальных юридических рисков."
          ]
        },
        {
          "titleDescription": "Предоставление юридических консультаций и поддержки",
          "span": ["Предоставление: ", "Консультации: "],
          "li": [
            "Предоставление юридических консультаций и поддержки внутренним командам для обеспечения соблюдения всех применимых законов и нормативных актов.",
            "Консультирование клиентов по их правам и обязанностям по контрактам страхования авто."
          ]
        },
        {
          "titleDescription": "Анализ претензий и оценка ответственности",
          "span": ["Оценка и проверка: ", "Исполнение: "],
          "li": [
            "Оценка ущерба и претензий по страхованию для определения их обоснованности и размера.",
            "Проведение оценки ответственности для определения того, несет ли страховая компания ответственность за убытки и в какой степени."
          ]
        },
        {
          "titleDescription": "Переговоры и разрешение споров",
          "span": ["Ведение: ", "Участие: "],
          "li": [
            "Ведение переговоров с истцами для достижения справедливых и разумных решений.",
            "Участие в процедурах разрешения споров для урегулирования конфликтов между сторонами."
          ]
        },
        {
          "titleDescription": "Соответствие и юридическая соответствие",
          "span": ["Обеспечение: ", "Мониторинг и внедрение: "],
          "li": [
            "Соблюдение всех юридических и нормативных требований.",
            "Внедрение политик соблюдения для обеспечения законного поведения."
          ]
        }
      ]
    },
    {
      "title": "Инспектор службы безопасности",
      "company": "",
      "companyDescription": "Соматическая больница Федеральной службы исполнения наказаний",
      "link": "",
      "period": "Август 2007 - Февраль 2011",
      "location": "Россия, Самара",
      "responsibilities": "Основные обязанности:",
      "description": [
        {
          "titleDescription": "Координация встреч для заключенных",
          "span": ["Организация и планирование: ", "Обеспечение: "],
          "li": [
            "Медицинские, юридические и другие важные встречи для заключенных больницы.",
            "Своевременная координация всех встреч и их информирование соответствующих подразделений и заключенных."
          ]
        },
        {
          "titleDescription": "Создание расписаний и координация переводов",
          "span": ["Создание и управление: ", "Планирование и координация: "],
          "li": [
            "Создание расписаний для заключенных, чтобы обеспечить выполнение их запланированных мероприятий и обязательств.",
            "Планирование и координация переводов внутри тюрьмы и в другие учреждения для обеспечения бесперебойной работы."
          ]
        },
        {
          "titleDescription": "Мониторинг судебных назначений",
          "span": ["Мониторинг и отслеживание: ", "Координация: "],
          "li": [
            "Мониторинг судебных назначений для обеспечения своевременного появления заключенных на слушания и судебные разбирательства.",
            "Координация с судебными органами и другими заинтересованными сторонами для обеспечения эффективной коммуникации и сотрудничества."
          ]
        },
        {
          "titleDescription": "Проверки безопасности и патрулирование",
          "span": [
            "Проведение: ",
            "Выявление и устранение: ",
            "Сотрудничество: "
          ],
          "li": [
            "Регулярные проверки безопасности и патрулирование территории больницы для обеспечения безопасности заключенных, сотрудников и посетителей.",
            "Выявление и устранение рисков безопасности для поддержания безопасной и защищенной среды.",
            "Сотрудничество с охранным персоналом и другими подразделениями для внедрения и контроля за соблюдением протоколов и политик безопасности."
          ]
        }
      ]
    }
  ],
  "projects": {
    "titleProject": "Мои проекты",
    "discription1": "Этот проект представляет собой погодное приложение, разработанное на TypeScript с использованием React и Redux. Приложение позволяет пользователю получать информацию о погоде в нужном городе. Пользователь вводит название города, и запрос отправляется на сервер. Сервер возвращает текущие данные о погоде, которые затем отображаются в приложении.",
    "title1": "Погода",
    "discription2": "LeafGrow — это проект для управления выращиванием каннабиса. Фронтенд часть приложения была разработана с использованием TypeScript, React и Redux, что позволяет бесшовно интегрироваться с бэкендом и базой данных. Оно предоставляет удобный и отзывчивый интерфейс, который оптимально работает на различных устройствах. LeafGrow помогает пользователям контролировать и управлять всеми аспектами выращивания каннабиса.",
    "title2": "LeafGrow",
    "discription3": "Мини-проект, в котором пользователь получает интересный факт о кошках с сервера по запросу. Фронтенд, разработанный на TypeScript и React. Приложение интегрируется с сервером для получения фактов о кошках и предлагает автоматический перевод на немецкий, английский или русский язык в зависимости от выбранного пользователем языка.",
    "title3": "Факты о кошках",
    "discription4": "Мини-проект, в котором пользователь получает случайную шутку с сервера по запросу. Фронтенд, разработанный на TypeScript и React, использует Redux для управления состоянием. Приложение интегрирует бэкенд для получения шуток и предоставляет автоматический перевод на немецкий, английский или русский языки в зависимости от выбранного пользователем языка.",
    "title4": "Случайные шутки",
    "cat": {
      "buttonBack" : "Мои проекты",
      "buttonCat" : "Факт о котах ",
      "buttonDeleteAll" : "Удалить всё"
    },
    "weather" : {
      "buttonSave" : "Сохранить",
      "buttonDelete" : "Удалить",
      "buttonDeleteAll" : "Удалить все карточки",
      "bunttonProjects" : "Мои",
      "bunttonProjects_br" : "проекты",
      "buttonSearch": "Поиск",
      "buttonMyWeather" : "Моя погода",
      "ooops" : "Упс, у вас нет сохраненной погоды ..."
    },
    "randomJokes" : {
      "buttonGet" : "Рандомная шутка",
      "buttonDeleteAll" : "Удалить всё",
      "bunttonProjects" : "Мои",
      "bunttonProjects_br" : "Проекты"
    }
  },
  "tooltips" : {
    "tooltipStart" : "в начало",
    "tooltipNext" : "далее",
    "tooltipBack" : "назад"
  }
}
      
    
  
  
